#include <stdio.h>

int main()
{
    char a = 5;
    // 警告原因是有效位数超出8位, 截断时会错误计算
    char b = -12655;

    /**
     * 赋值的数字
     * a: 000000000000000000000000 00000101 (补码)
     * b: 111111111111111111001110 10010001 (补码)
     * 
     * int  -> 4 byte -> 32 bit
     * char -> 1 byte -> 8 bit
     * 
     * char只能存储8位, 所以存储时进行截断
     * a: 00000101 (补码)
     * b: 10010001 (补码)
     * 
     * 计算时隐式转换为int, 需要补齐32位进行运算
     * a: 000000000000000000000000 00000101 (补码)
     * b: 111111111111111111111111 10010001 (补码)
     * 
     * 使用补码进行二进制计算
     * a + b: 111111111111111111111111 10010110 (补码)
     * 
     * 结果隐式转换回char, 进行截断
     * a + b: 10010110 (补码)
     * 
     * 8位补码转换回原码
     * a + b: 11101010 (原码)
     * 
     * 转换为十进制
     * a + b: -106
     */
    printf("%d", a + b); //-106

    return 0;
}